import { Composer, Context } from "grammy";
import { BotAction } from "../types/enums";
import { backKeyboard } from "../keyboards";

export const pricesHandler = new Composer<Context>();

pricesHandler.callbackQuery(BotAction.PRICES, async (ctx) => {
    await ctx.answerCallbackQuery();

    const text =
        `💰 **Прайс-лист (10-дневный курс)**\n` +
        `_Актуально на 20.01.2025_\n\n` +
        
        `1️⃣ **Филиал "Насиба Бону" (Чиназ)**\n` +
        `— 2, 3, 4-местные: 4 150 000 сум\n\n` +

        `2️⃣ **Филиал "Юнусабад"**\n` +
        `— 2-местный: 5 900 000 сум\n` +
        `— 3, 4-местные: 5 500 000 сум\n\n` +

        `3️⃣ **Филиал "Аккурган"**\n` +
        `— 2-местный: 4 800 000 сум (Люкс: 5.57 млн)\n` +
        `— Для иностр. граждан: 5 100 000 сум\n\n` +

        `4️⃣ **Филиал "Янги Базар"**\n` +
        `— 2-местный: 4 620 000 сум\n` +
        `— 3-местный: 4 350 000 сум\n` +
        `— 4-местный: 4 070 000 сум\n\n` +

        `5️⃣ **Филиал "Зангиота"**\n` +
        `— 2-местный: 5 720 000 сум\n` +
        `— 3, 4-местные: 5 300 000 сум\n\n` +

        `6️⃣ **Филиал "Паркент"**\n` +
        `— 1-местный: 4 840 000 сум\n` +
        `— 2-местный: 4 620 000 сум\n\n` +

        `7️⃣ **Филиал "Фотима Султон"**\n` +
        `— 2-местный: 6 400 000 сум\n` +
        `— 3-местный: 5 900 000 сум`;

    await ctx.reply(text, { reply_markup: backKeyboard, parse_mode: "Markdown" });
});